---
title: UnifiedBitmap
classe: Autodesk.Revit.DB.Visual.UnifiedBitmap
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 13
---

# UnifiedBitmap

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String TextureLinkTextureTransforms { get; }` | `UnifiedBitmap.TextureLinkTextureTransforms` | String |
| `String TextureOffsetLock { get; }` | `UnifiedBitmap.TextureOffsetLock` | String |
| `String TextureRealWorldOffsetX { get; }` | `UnifiedBitmap.TextureRealWorldOffsetX` | String |
| `String TextureRealWorldOffsetY { get; }` | `UnifiedBitmap.TextureRealWorldOffsetY` | String |
| `String TextureRealWorldScaleX { get; }` | `UnifiedBitmap.TextureRealWorldScaleX` | String |
| `String TextureRealWorldScaleY { get; }` | `UnifiedBitmap.TextureRealWorldScaleY` | String |
| `String TextureScaleLock { get; }` | `UnifiedBitmap.TextureScaleLock` | String |
| `String TextureURepeat { get; }` | `UnifiedBitmap.TextureURepeat` | String |
| `String TextureVRepeat { get; }` | `UnifiedBitmap.TextureVRepeat` | String |
| `String TextureWAngle { get; }` | `UnifiedBitmap.TextureWAngle` | String |
| `String UnifiedbitmapBitmap { get; }` | `UnifiedBitmap.UnifiedbitmapBitmap` | String |
| `String UnifiedbitmapInvert { get; }` | `UnifiedBitmap.UnifiedbitmapInvert` | String |
| `String UnifiedbitmapRGBAmount { get; }` | `UnifiedBitmap.UnifiedbitmapRGBAmount` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```